{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Домашнее задание к занятию 1. Знакомство с Python"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- Напишите программу, которая последовательно запрашивает у пользователя Дату и Описание задачи, а затем выводит их через пробел.\n",
    "- Модифицируйте программу из задания 1 таким образом, чтобы запрос даты и задачи выполнялся трижды и после этого результаты выводились на экран построчно в формате: на одной строчке дата и задача через пробел.\n",
    "- Модифицируйте программу из задания 2 таким образом, чтобы данные не выводились на экран, а сохранялись в словарь. Ключами в этом словаре должны быть даты, а значениями - соответствующие им задачи."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'сегодн': 'сделать чтото', 'сегодня': 'сделать', '': ''}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "date, task = input(\"Введите дату: \"), input(\"Введите задачу: \")\n",
    "date1, task1 = input(\"Введите дату: \"), input(\"Введите задачу: \")\n",
    "date2, task2 = input(\"Введите дату: \"), input(\"Введите задачу: \")\n",
    "\n",
    "\n",
    "todolist = {date : task, \n",
    "            date1 : task1, \n",
    "            date2 : task2\n",
    "            }\n",
    "\n",
    "\n",
    "display(todolist)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Домашнее задание к занятию 2. Первая программа"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- Модифицируйте программу, написанную на занятии так, чтобы выход из нее осуществлялся не только при вводе неизвестной команды, но и при вводе специальной команды exit. Сделайте так, чтобы при вводе этой команды программа выводила на экран текст: \"Спасибо за использование! До свидания!\"\n",
    "- Давайте усложним нашу программу. Сделайте следующие изменения:\n",
    "\n",
    "    - Заведите 3 списка: today, tomorrow, other (вы можете назвать переменные по-другому).\n",
    "    - Измените блок кода, который выполняет команду add:\n",
    "    - Дополнительно запросите у пользователя дату выполнения задачи.\n",
    "    - В зависимости от введенной даты добавьте задачу в один из списков по следующим правилам:\n",
    "    - Если пользователь ввел \"Сегодня\", добавьте задачу в список today.\n",
    "    - Если пользователь ввел \"Завтра\", добавьте задачу в список tomorrow.\n",
    "    - Если пользователь ввел любое другое значение, добавьте задачу в список other.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Задача добавлена\n",
      "Задача добавлена\n",
      "Задача добавлена\n",
      "Какой день?\n",
      "['Помыть пол']\n",
      "Какой день?\n",
      "['Сделать уроки']\n",
      "Какой день?\n",
      "['Помыть посуду']\n",
      "Неизвестная команда\n"
     ]
    }
   ],
   "source": [
    "HELP = \"\"\"\n",
    "help - напечатать справку по программе.\n",
    "add  - добавить задачу в список (название задачи запрашиваем у пользователя).\n",
    "show - напечатать все добавленные задачи\n",
    "exit - выход\n",
    "\"\"\"\n",
    "\n",
    "today = []\n",
    "tommorow = [] \n",
    "other = []\n",
    "\n",
    "\n",
    "while True:\n",
    "    command = input(\"Введите команду:\\n\")\n",
    "    if command == \"help\":\n",
    "        print(HELP)\n",
    "    elif command == \"show\":\n",
    "        print(\"Какой день?\")\n",
    "        day = input()\n",
    "        if day == \"Сегодня\":\n",
    "            print(today)\n",
    "        elif day == \"Завтра\":\n",
    "            print(tommorow)\n",
    "        elif day != \"Сегодня\" and \"Завтра\":\n",
    "            print(other)\n",
    "    elif command == \"add\":\n",
    "        task = input(\"Введите название задачи:\\n\")\n",
    "        date = input(\"Введите день (дату):\\n\")\n",
    "        if date == \"Сегодня\": today.append(task)\n",
    "        elif date == \"Завтра\": tommorow.append(task)\n",
    "        else: other.append(task)\n",
    "        print(\"Задача добавлена\")\n",
    "    elif command == \"exit\":\n",
    "        print(\"Спасибо за использование! До свидания!\")\n",
    "        break\n",
    "    elif command not in HELP:\n",
    "        print(\"Неизвестная команда\")\n",
    "        break  # или run = False\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Домашнее задание к занятию 3. Функции. Разработка приложения ToDo"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- Реализуйте функцию count_letter, которая принимает список слов и некоторую букву и возвращает количество слов в списке, в которых эта буква встречается хотя бы один раз.\n",
    "Например, для списка ['python', 'c++', 'c', 'scala', 'java'] и буквы c ваша функция должна вернуть число 3.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "language = ['python', 'c++', 'c', 'scala', 'java']\n",
    "\n",
    "\n",
    "def count_letter(language, letter):\n",
    "    count = 0\n",
    "    for word in language:\n",
    "        if letter in word:\n",
    "            count += 1\n",
    "    return count\n",
    "                \n",
    "print(count_letter(language, \"c\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Домашнее задание к занятию 4. Создаем первого Telegram-бота"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- Модифицируйте нашего ЭхоБота таким образом, чтобы в ответ на сообщение, в котором присутствует ваше имя, он не повторял его, а отвечал: \"Ба! Знакомые все лица!\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Домашнее задание к занятию 5. Превращаем программу ToDo в бота"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- Расширьте функциональность бота возможностью на ваш выбор.\n",
    "Примеры дополнительных возможностей:\n",
    "\n",
    "- Выводить ошибку при добавлении задачи, в которой меньше 3х символов.\n",
    "- Печатать задачи на несколько дат: принимать в команде print не одну дату, а произвольное количество.\n",
    "- При добавлении задачи учитывать отдельным параметром ее категорию. При выводе печатать категории задач со знаком @: Помыть посуду @Домашние дела."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
